In [1]:
# import libraries
import pandas as pd

In [2]:
# import dataframe
df = pd.DataFrame({'movie':['2000 John Travoltra','1999 Nicole Kidman' ,'2006 Jeniffer Lopez '] })

In [3]:
df.head(5)

                  movie
0   2000 John Travoltra
1    1999 Nicole Kidman
2  2006 Jeniffer Lopez

In [5]:
df['movie'].str.split(' ',expand = True).rename(columns = {0:'Year',1:'Brand', 2:'Subject'})

   Year     Brand    Subject     3
0  2000      John  Travoltra  None
1  1999    Nicole     Kidman  None
2  2006  Jeniffer      Lopez

In [7]:
df.head(5)

                  movie
0   2000 John Travoltra
1    1999 Nicole Kidman
2  2006 Jeniffer Lopez